---
type: StructuralSectionRectangleHSS
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionRectangleHSS

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionRectangleHSS | 2015 | `public StructuralSectionRectangleHSS ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double outerFillet , double centroidHorizontal , double centroidVertic` |